# Staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/customer-api/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/Connectilly/customer-api-staging/runs/run-T5pRigWBtbk7ETNF

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.aws_lambda_api.data.archive_file.default: Refreshing...
module.aws_lambda_api.data.aws_iam_policy_document.default: Refreshing...
module.aws_lambda_api.data.aws_iam_policy_document.default: Refresh complete after 0s [id=3693445097]
module.aws_lambda_api.aws_iam_role.default: Refreshing state... [id=lambda-execution-customer-api-customer-api-staging]
module.aws_lambda_api.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-customer-api-customer-api-staging-20230422113144397800000001]
module.aws_lambda_api.data.archive_file.default: Refresh complete after 1s [id=edfc614b91aa2a91f66b53a85a54315efb08e245]
module.aws_lambda_api.aws_lambda_function.default: Refreshing state... [id=customer-api-customer-api-staging]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws_lambda_api.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/customer-api-customer-api-staging"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*